# Help Desk - Easy

## Scenario
A software company has been successful in selling its products to a number of customer organisations, and there is now a high demand for technical support. There is already a system in place for logging support calls taken over the telephone and assigning them to engineers, but it is based on a series of spreadsheets. With the growing volume of data, using the spreadsheet system is becoming slow, and there is a significant risk that errors will be made.

![rel](https://sqlzoo.net/w/images/3/38/Helpdesk.png)

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1.
There are three issues that include the words "index" and "Oracle". Find the call_date for each of them

```
+---------------------+----------+
| call_date           | call_ref |
+---------------------+----------+
| 2017-08-12 16:00:00 |     1308 |
| 2017-08-16 14:54:00 |     1697 |
| 2017-08-16 19:12:00 |     1731 |
+---------------------+----------+
```

In [2]:
%%sql
SELECT "Call_date" call_date, "Call_ref" call_ref
  FROM "Issue"
    WHERE "Detail" LIKE '%index%' AND "Detail" LIKE '%Oracle%';

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[(datetime.datetime(2017, 8, 12, 16, 0), 1308),
 (datetime.datetime(2017, 8, 16, 14, 54), 1697),
 (datetime.datetime(2017, 8, 16, 19, 12), 1731)]

## 2.
Samantha Hall made three calls on 2017-08-14. Show the date and time for each

```
+---------------------+------------+-----------+
| call_date           | first_name | last_name |
+---------------------+------------+-----------+
| 2017-08-14 10:10:00 | Samantha   | Hall      |
| 2017-08-14 10:49:00 | Samantha   | Hall      |
| 2017-08-14 18:18:00 | Samantha   | Hall      |
+---------------------+------------+-----------+
```

In [3]:
%%sql
SELECT "Call_date", "First_name", "Last_name"
FROM "Issue" JOIN "Caller" ON ("Issue"."Caller_id"="Caller"."Caller_id")
WHERE "First_name"='Samantha' AND "Last_name"='Hall' AND Date("Call_date")='2017-08-14';

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[(datetime.datetime(2017, 8, 14, 10, 10), 'Samantha', 'Hall'),
 (datetime.datetime(2017, 8, 14, 10, 49), 'Samantha', 'Hall'),
 (datetime.datetime(2017, 8, 14, 18, 18), 'Samantha', 'Hall')]

## 3.
There are 500 calls in the system (roughly). Write a query that shows the number that have each status.

```
+--------+--------+
| status | Volume |
+--------+--------+
| Closed |    486 |
| Open   |     10 |
+--------+--------+
```

In [4]:
%%sql
SELECT "Status" status, COUNT(*) "Volume" FROM "Issue"
GROUP BY "Status";

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('Closed', 486), ('Open', 10)]

## 4.
Calls are not normally assigned to a manager but it does happen. How many calls have been assigned to staff who are at Manager Level?

```
+------+
| mlcc |
+------+
|   51 |
+------+
```

In [5]:
%%sql
SELECT COUNT("Issue"."Call_ref") mlcc
FROM "Issue" JOIN "Staff" ON ("Issue"."Assigned_to"="Staff"."Staff_code") 
  JOIN "Level" ON ("Staff"."Level_code"="Level"."Level_code")
WHERE "Manager"='Y';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[(51,)]

## 5.
Show the manager for each shift. Your output should include the shift date and type; also the first and last name of the manager.

```
+------------+------------+------------+-----------+
| Shift_date | Shift_type | first_name | last_name |
+------------+------------+------------+-----------+
| 2017-08-12 | Early      | Logan      | Butler    |
| 2017-08-12 | Late       | Ava        | Ellis     |
| 2017-08-13 | Early      | Ava        | Ellis     |
| 2017-08-13 | Late       | Ava        | Ellis     |
| 2017-08-14 | Early      | Logan      | Butler    |
| 2017-08-14 | Late       | Logan      | Butler    |
| 2017-08-15 | Early      | Logan      | Butler    |
| 2017-08-15 | Late       | Logan      | Butler    |
| 2017-08-16 | Early      | Logan      | Butler    |
| 2017-08-16 | Late       | Logan      | Butler    |
+------------+------------+------------+-----------+
```

In [6]:
%%sql
SELECT DISTINCT Date("Shift_date") "Shift_date", "Shift_type", 
  "First_name" first_name, "Last_name" last_name
    FROM "Shift" JOIN "Staff" ON ("Shift"."Manager"="Staff"."Staff_code")
    ORDER BY "Shift_date", "Shift_type";

 * postgresql://postgres:***@localhost/sqlzoo
10 rows affected.

[(datetime.date(2017, 8, 12), 'Early', 'Logan', 'Butler'),
 (datetime.date(2017, 8, 12), 'Late', 'Ava', 'Ellis'),
 (datetime.date(2017, 8, 13), 'Early', 'Ava', 'Ellis'),
 (datetime.date(2017, 8, 13), 'Late', 'Ava', 'Ellis'),
 (datetime.date(2017, 8, 14), 'Early', 'Logan', 'Butler'),
 (datetime.date(2017, 8, 14), 'Late', 'Logan', 'Butler'),
 (datetime.date(2017, 8, 15), 'Early', 'Logan', 'Butler'),
 (datetime.date(2017, 8, 15), 'Late', 'Logan', 'Butler'),
 (datetime.date(2017, 8, 16), 'Early', 'Logan', 'Butler'),
 (datetime.date(2017, 8, 16), 'Late', 'Logan', 'Butler')]